Repository: Kanunnikoff/Glagolitsa-iOS
Catalog: Localizable.xcstrings
Source language: en
Languages: ru

source: **Original:** %@
ru: **Оригинал:** %@

source: **Translation:** %@
ru: **Перевод:** %@

source: ^[%lld messages](inflect: true)
ru: %lld сообщений

source: ^[%lld translations](inflect: true)
ru: %lld переводов

source: © 2025 Dmitry Kanunnikoff
ru: © 2025 Дмитрiй Канунниковъ

source: © 2026 Dmitry Kanunnikoff
ru: © 2026 Дмитрий Канунников

source: A bit of history
ru: Немного истории

source: A dictionary app for the Interslavic language.
ru: Приложение-словарь для межславянского языка.

source: About
ru: О программе

source: AI Mode
ru: Режим ИИ

source: Alignment
ru: Выравнивание

source: All that's left to do is log in.
ru: Осталось только авторизоваться.

source: Allow Glagolitsa to add images to Photos in System Settings.
ru: Разрешите Глаголице добавлять картинки в Фото в настройках системы.

source: Are you sure you want to delete all translations?
ru: Вы уверены, что хотите удалить все переводы?

source: Are you sure you want to delete the chat message?
ru: Вы уверены, что хотите удалить сообщение беседы?

source: Are you sure you want to delete the translation?
ru: Вы уверены, что хотите удалить перевод?

source: Are you sure you want to delete your account? All your messages will also be deleted. The operation is irreversible.
ru: Вы уверены, что хотите удалить свою учётную запись? Все Ваши сообщения также будут удалены. Операция необратима.

source: Are you sure you want to sign out?
ru: Вы уверены, что хотите выйти?

source: Attention
ru: Внимание

source: Attention!
ru: Внимание!

source: Background Blur
ru: Размытие фона

source: Background Color
ru: Цвет фона

source: Background Image
ru: Фоновое изображение

source: Basic settings for the entire application.
ru: Основные настройки для всего приложения.

source: Block
ru: Заблокировать

source: Block User
ru: Заблокировать пользователя

source: Blocked Users
ru: Заблокированные пользователи

source: By joining the conversation, you agree to adhere to generally accepted moral standards, avoid using obscene words and expressions, as well as hateful insults based on religious, national, racial and other grounds. This conversation is intended for cultured people to communicate on intelligent and useful topics, or at least neutral ones. Violations of this agreement may result in suspension of the account or even its complete blocking.
ru: Присоединяясь к беседе, Вы обязуетесь придерживаться общепринятых норм морали, избегать употребления нецензурных слов и выражений, а также оскорблений на почве ненависти по религиозному, национальному, расовому и прочим признакам. Эта беседа предназначена для культурных людей для общения на умные и полезные темы, ну или, как минимум, нейтральные. За нарушения данного соглашения предусмотрены приостановка действия учётной записи или же вовсе её полная блокировка.

source: Cancel
ru: Отмена

source: Capital Letters - Abbreviations
ru: Заглавные буквы - аббревиатуры

source: center
ru: по центру

source: Change
ru: Изменить

source: Change Name
ru: Изменить имя

source: Chat
ru: Беседа

source: Chat Unavailable
ru: Беседа недоступна

source: Clear
ru: Очистить

source: Confirm Deletion
ru: Подтверждать удаление

source: Conversation messages will be here
ru: Сообщения беседы будут здесь

source: Copy
ru: Копировать

source: Copy Original
ru: Копировать оригинал

source: Copy Translation
ru: Копировать перевод

source: Create Date
ru: Дата создания

source: Cyrillic
ru: Кириллица

source: Delete
ru: Удалить

source: Delete Account
ru: Удалить аккаунт

source: Delete All
ru: Удалить всё

source: Delete Message
ru: Удалить сообщение

source: Demote from Moderators
ru: Разжаловать из модераторов

source: Detailed information about how the application uses your data.
ru: Подробная информация о том, как приложение использует Ваши данные.

source: Do you have something to say? Speak up!
ru: Вам есть что сказать? Говорите!

source: Edit
ru: Изменить

source: Edit Message
ru: Редактировать сообщение

source: edited
ru: отредактировано

source: Email
ru: Почта

source: Enter a new user name
ru: Введите новое имя пользователя

source: Error
ru: Ошибка

source: Existing
ru: Существующий

source: Export
ru: Экспортировать

source: Feedback
ru: Обратная связь

source: Font
ru: Шрифт

source: From Cyrillic to Glagolitic
ru: Из кириллицы в глаголицу

source: From Glagolitic to Cyrillic
ru: Из глаголицы в кириллицу

source: From Modern to Pre-Revolutionary
ru: Из современного в дореволюционный

source: From Pre-Revolutionary to Modern
ru: Из дореволюционного в современный

source: General
ru: Основные

source: Generate
ru: Генерировать

source: Glagolitic
ru: Глаголица

source: Glagolitic Letter for I
ru: Глаголическая буква для «и»

source: Glagolitsa
ru: Глаголица

source: Global Block
ru: Глобальный блок

source: Hello, world!
ru: Привет, мир!

source: Here you will see the conversation messages
ru: Здесь Вы увидите сообщения беседы

source: History
ru: История

source: Horizontal Padding
ru: Гориз. отступ

source: I really appreciate your good intention, but for some reason the purchase could not be completed... If you do not change your mind about supporting me, then please try again later.
ru: Я очень ценю Ваше доброе намерение, однако по какой-то причине осуществить покупку не удалось... Если не передумаете поддержать меня, то, пожалуйста, попробуйте позже снова.

source: If you like the result of my work, then you can, if you wish, support me in one of the above ways.
ru: Если Вам нравится результат моего труда, то Вы можете, при желании, поддержать меня одним из вышеперечисленных способов.

source: In case of questions or suggestions, I am at your service. Let's be in touch!
ru: В случае вопросов или предложений, я к Вашим услугам. Будем на связи!

source: Keep Translation History
ru: Хранить историю переводов

source: leading
ru: влево

source: Log in to see the number of messages
ru: Авторизуйтесь, чтобы увидеть количество сообщений

source: M
ru: С

source: Make Moderator
ru: Сделать модератором

source: Menu
ru: Меню

source: Modern
ru: Современный

source: Name
ru: Имя

source: Name Change
ru: Изменение имени

source: New
ru: Новый

source: New reports from users will appear here.
ru: Новые жалобы от пользователей появятся здесь.

source: Next
ru: Далее

source: No Blocked Users
ru: Нет заблокированных пользователей

source: No Reports
ru: Нет жалоб

source: OK
ru: ДОБРО

source: Opens a menu where you can select a dictionary, sort direction, filtering, spelling, and download new dictionaries.
ru: Открывает меню, в котором можно выбрать словарь, направление сортировки, фильтрацию, орфографию, а также загрузить новые словари.

source: Original
ru: Оригинал

source: Original (Cyrillic)
ru: Исходный текст (кириллица)

source: Original (Glagolitic)
ru: Исходный текст (глаголица)

source: Other Apps
ru: Другие приложения

source: P
ru: Д

source: Password
ru: Пароль

source: Please be aware that translation errors are possible in this mode. Furthermore, Google limits the number of requests. Never enter any sensitive data in AI mode, as everything is sent to Google.
ru: Пожалуйста, имейте ввиду, что в данном режиме возможны ошибки перевода. Кроме того, есть ограничения на число запросов со стороны Google. Ни в коем случае не вводите в режиме ИИ никакие конфиденциальные данные, т.к. всё отправляется в Google.

source: Pre-Revolutionary
ru: Дореволюционный

source: Prepare
ru: Подготовить

source: Privacy Policy
ru: Политика конфиденциальности

source: Rate
ru: Оценить

source: Read
ru: Читать

source: Reason: %@
ru: Причина: %@

source: Remove Moderator
ru: Снять роль модератора

source: Reply
ru: Ответить

source: Reply to %@
ru: Ответ %@

source: Report
ru: Пожаловаться

source: Reported by: %@
ru: Пожаловался: %@

source: Reported user: %@
ru: Субъект жалобы: %@

source: Reports
ru: Жалобы

source: Resolved: %@
ru: Решено: %@

source: Save
ru: Сохранить

source: Save your first translation and it will appear here.
ru: Сохраните свой первый перевод, и он появится здесь.

source: Search...
ru: Искать...

source: Send Again
ru: Отправить снова

source: Settings
ru: Настройки

source: Settings for storing translation history.
ru: Настройки хранения истории переводов.

source: Settings for translation between Cyrillic and Glagolitic.
ru: Настройки, связанные с переводом между кириллицей и глаголицей.

source: Share
ru: Поделиться

source: Shared Image
ru: Изображение

source: Show Chat Tab
ru: Показывать вкладку беседы

source: Show Splash Screen
ru: Показывать заставку

source: Sign In
ru: Войти

source: Sign Out
ru: Выйти

source: Sign Up
ru: Зарегистрироваться

source: Size
ru: Размер

source: SKIP
ru: ПРОПУСК

source: Start
ru: Начать

source: Support
ru: Поддержка

source: System
ru: Системный

source: Text Color
ru: Цвет текста

source: Thank you so much for your support!
ru: Огромное спасибо за Вашу поддержку!

source: Thanks for the tip!
ru: Спасибо за чаевые!

source: The quoted message was not found. It may have been removed.
ru: Цитируемое сообщение не найдено. Возможно, оно было удалено.

source: Tips
ru: Чаевые

source: To add your message, use the input field below.
ru: Для добавления своего сообщения используйте поле ввода снизу.

source: Total reports on user: %lld
ru: Всего жалоб на пользователя: %lld

source: trailing
ru: вправо

source: Translation
ru: Перевод

source: Translation (Cyrillic)
ru: Перевод (кириллица)

source: Translation (Glagolitic)
ru: Перевод (глаголица)

source: Translation Details
ru: Детали перевода

source: Translation Direction
ru: Направление перевода

source: Translation Image
ru: Картинка перевода

source: Translator
ru: Переводчик

source: Translator into pre-revolutionary orthography
ru: Переводчикъ на дореволюціонную орѳографію

source: Unblock
ru: Разблокировать

source: Unblock User
ru: Разблокировать пользователя

source: Unknown Font
ru: Неизвестный шрифт

source: Update
ru: Обновить

source: Use Archaic Words
ru: Использовать устаревшие слова

source: User Name
ru: Имя пользователя

source: VARIANT 1
ru: ВАРИАНТ 1

source: VARIANT 2
ru: ВАРИАНТ 2

source: Various settings for chat.
ru: Различные настройки беседы.

source: Various settings for translation from one spelling to another.
ru: Различные настройки перевода из одной орфографии в другую.

source: Version %@, build %@
ru: Версия %1$@, сборка %2$@

source: Vertical Padding
ru: Верт. отступ

source: Welcome to Interslavic!
ru: Добро пожаловать в Interslavic!

source: What does this application give you
ru: Что Вам даёт сие приложение

source: What is Interslavic?
ru: Что такое межславянский?

source: When you block someone in chat, they will appear here.
ru: Когда Вы заблокируете кого-то в беседе, он появится здесь

source: Write a letter
ru: Написать письмо

source: You have been sent a letter with a link to activate your account. After activation, click the "Update" button.
ru: Вам отправлено письмо со ссылкой для активации аккаунта. После активации нажмите кнопку «Обновить».

source: Your opinion is very important to me. Please feel free to rate and write a review.
ru: Ваше мнение очень важно для меня. Пожалуйста, не поленитесь поставить оценку и написать отзыв.

source: Your translation history will be here
ru: Здесь будет история Ваших переводов
